{"format": "layers-model", "generatedBy": "keras v3.5.0", "convertedBy": "TensorFlow.js Converter v4.20.0", "modelTopology": {"keras_version": "3.5.0", "backend": "tensorflow", "model_config": {"class_name": "TED", "config": {"name": "ted_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "ted_2/dense_block_2/dense_layer_2/conv2d_20/kernel", "shape": [3, 3, 32, 48], "dtype": "float32"}, {"name": "ted_2/dense_block_2/dense_layer_2/conv2d_20/bias", "shape": [48], "dtype": "float32"}, {"name": "ted_2/dense_block_2/dense_layer_2/separable_conv2d_8/depthwise_kernel", "shape": [3, 3, 48, 1], "dtype": "float32"}, {"name": "ted_2/dense_block_2/dense_layer_2/separable_conv2d_8/pointwise_kernel", "shape": [1, 1, 48, 48], "dtype": "float32"}, {"name": "ted_2/dense_block_2/dense_layer_2/separable_conv2d_8/bias", "shape": [48], "dtype": "float32"}, {"name": "ted_2/dense_block_2/dense_layer_2/batch_normalization_20/gamma", "shape": [48], "dtype": "float32"}, {"name": "ted_2/dense_block_2/dense_layer_2/batch_normalization_20/beta", "shape": [48], "dtype": "float32"}, {"name": "ted_2/dense_block_2/dense_layer_2/batch_normalization_21/gamma", "shape": [48], "dtype": "float32"}, {"name": "ted_2/dense_block_2/dense_layer_2/batch_normalization_21/beta", "shape": [48], "dtype": "float32"}, {"name": "ted_2/dense_block_2/dense_layer_2/batch_normalization_20/moving_mean", "shape": [48], "dtype": "float32"}, {"name": "ted_2/dense_block_2/dense_layer_2/batch_normalization_20/moving_variance", "shape": [48], "dtype": "float32"}, {"name": "ted_2/dense_block_2/dense_layer_2/batch_normalization_21/moving_mean", "shape": [48], "dtype": "float32"}, {"name": "ted_2/dense_block_2/dense_layer_2/batch_normalization_21/moving_variance", "shape": [48], "dtype": "float32"}, {"name": "ted_2/double_conv_block_4/conv2d_18/kernel", "shape": [5, 5, 3, 16], "dtype": "float32"}, {"name": "ted_2/double_conv_block_4/conv2d_18/bias", "shape": [16], "dtype": "float32"}, {"name": "ted_2/double_conv_block_4/separable_conv2d_6/depthwise_kernel", "shape": [5, 5, 16, 1], "dtype": "float32"}, {"name": "ted_2/double_conv_block_4/separable_conv2d_6/pointwise_kernel", "shape": [1, 1, 16, 16], "dtype": "float32"}, {"name": "ted_2/double_conv_block_4/separable_conv2d_6/bias", "shape": [16], "dtype": "float32"}, {"name": "ted_2/double_conv_block_4/batch_normalization_16/gamma", "shape": [16], "dtype": "float32"}, {"name": "ted_2/double_conv_block_4/batch_normalization_16/beta", "shape": [16], "dtype": "float32"}, {"name": "ted_2/double_conv_block_4/batch_normalization_17/gamma", "shape": [16], "dtype": "float32"}, {"name": "ted_2/double_conv_block_4/batch_normalization_17/beta", "shape": [16], "dtype": "float32"}, {"name": "ted_2/double_conv_block_4/batch_normalization_16/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "ted_2/double_conv_block_4/batch_normalization_16/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "ted_2/double_conv_block_4/batch_normalization_17/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "ted_2/double_conv_block_4/batch_normalization_17/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "ted_2/double_conv_block_5/conv2d_19/kernel", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "ted_2/double_conv_block_5/conv2d_19/bias", "shape": [32], "dtype": "float32"}, {"name": "ted_2/double_conv_block_5/separable_conv2d_7/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "ted_2/double_conv_block_5/separable_conv2d_7/pointwise_kernel", "shape": [1, 1, 32, 32], "dtype": "float32"}, {"name": "ted_2/double_conv_block_5/separable_conv2d_7/bias", "shape": [32], "dtype": "float32"}, {"name": "ted_2/double_conv_block_5/batch_normalization_18/gamma", "shape": [32], "dtype": "float32"}, {"name": "ted_2/double_conv_block_5/batch_normalization_18/beta", "shape": [32], "dtype": "float32"}, {"name": "ted_2/double_conv_block_5/batch_normalization_19/gamma", "shape": [32], "dtype": "float32"}, {"name": "ted_2/double_conv_block_5/batch_normalization_19/beta", "shape": [32], "dtype": "float32"}, {"name": "ted_2/double_conv_block_5/batch_normalization_18/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "ted_2/double_conv_block_5/batch_normalization_18/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "ted_2/double_conv_block_5/batch_normalization_19/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "ted_2/double_conv_block_5/batch_normalization_19/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "ted_2/double_fusion_2/depthwise_conv2d_4/kernel", "shape": [3, 3, 3, 8], "dtype": "float32"}, {"name": "ted_2/double_fusion_2/depthwise_conv2d_4/bias", "shape": [24], "dtype": "float32"}, {"name": "ted_2/double_fusion_2/depthwise_conv2d_5/kernel", "shape": [3, 3, 24, 1], "dtype": "float32"}, {"name": "ted_2/double_fusion_2/depthwise_conv2d_5/bias", "shape": [24], "dtype": "float32"}, {"name": "ted_2/single_conv_block_4/conv2d_21/kernel", "shape": [1, 1, 16, 32], "dtype": "float32"}, {"name": "ted_2/single_conv_block_4/conv2d_21/bias", "shape": [32], "dtype": "float32"}, {"name": "ted_2/single_conv_block_4/batch_normalization_22/gamma", "shape": [32], "dtype": "float32"}, {"name": "ted_2/single_conv_block_4/batch_normalization_22/beta", "shape": [32], "dtype": "float32"}, {"name": "ted_2/single_conv_block_4/batch_normalization_22/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "ted_2/single_conv_block_4/batch_normalization_22/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "ted_2/single_conv_block_5/conv2d_22/kernel", "shape": [1, 1, 32, 48], "dtype": "float32"}, {"name": "ted_2/single_conv_block_5/conv2d_22/bias", "shape": [48], "dtype": "float32"}, {"name": "ted_2/single_conv_block_5/batch_normalization_23/gamma", "shape": [48], "dtype": "float32"}, {"name": "ted_2/single_conv_block_5/batch_normalization_23/beta", "shape": [48], "dtype": "float32"}, {"name": "ted_2/single_conv_block_5/batch_normalization_23/moving_mean", "shape": [48], "dtype": "float32"}, {"name": "ted_2/single_conv_block_5/batch_normalization_23/moving_variance", "shape": [48], "dtype": "float32"}, {"name": "ted_2/up_conv_block_6/sequential_6/conv2d_23/kernel", "shape": [1, 1, 16, 1], "dtype": "float32"}, {"name": "ted_2/up_conv_block_6/sequential_6/conv2d_23/bias", "shape": [1], "dtype": "float32"}, {"name": "ted_2/up_conv_block_6/sequential_6/conv2d_transpose_8/kernel", "shape": [4, 4, 1, 1], "dtype": "float32"}, {"name": "ted_2/up_conv_block_6/sequential_6/conv2d_transpose_8/bias", "shape": [1], "dtype": "float32"}, {"name": "ted_2/up_conv_block_7/sequential_7/conv2d_24/kernel", "shape": [1, 1, 32, 1], "dtype": "float32"}, {"name": "ted_2/up_conv_block_7/sequential_7/conv2d_24/bias", "shape": [1], "dtype": "float32"}, {"name": "ted_2/up_conv_block_7/sequential_7/conv2d_transpose_9/kernel", "shape": [4, 4, 1, 1], "dtype": "float32"}, {"name": "ted_2/up_conv_block_7/sequential_7/conv2d_transpose_9/bias", "shape": [1], "dtype": "float32"}, {"name": "ted_2/up_conv_block_8/sequential_8/conv2d_25/kernel", "shape": [1, 1, 48, 16], "dtype": "float32"}, {"name": "ted_2/up_conv_block_8/sequential_8/conv2d_25/bias", "shape": [16], "dtype": "float32"}, {"name": "ted_2/up_conv_block_8/sequential_8/conv2d_transpose_10/kernel", "shape": [4, 4, 16, 16], "dtype": "float32"}, {"name": "ted_2/up_conv_block_8/sequential_8/conv2d_transpose_10/bias", "shape": [16], "dtype": "float32"}, {"name": "ted_2/up_conv_block_8/sequential_8/conv2d_26/kernel", "shape": [1, 1, 16, 1], "dtype": "float32"}, {"name": "ted_2/up_conv_block_8/sequential_8/conv2d_26/bias", "shape": [1], "dtype": "float32"}, {"name": "ted_2/up_conv_block_8/sequential_8/conv2d_transpose_11/kernel", "shape": [4, 4, 1, 1], "dtype": "float32"}, {"name": "ted_2/up_conv_block_8/sequential_8/conv2d_transpose_11/bias", "shape": [1], "dtype": "float32"}]}]}