{"format": "graph-model", "generatedBy": "2.15.0", "convertedBy": "TensorFlow.js Converter v4.20.0", "signature": {"inputs": {"input": {"name": "input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "352"}, {"size": "352"}]}}}, "outputs": {"Identity_1:0": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "352"}, {"size": "352"}]}}, "Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "352"}, {"size": "352"}]}}, "Identity_2:0": {"name": "Identity_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "352"}, {"size": "352"}]}}}}, "modelTopology": {"node": [{"name": "PartitionedCall/onnx_tf_prefix_/Concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "PartitionedCall/transpose_25/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/split_8", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "2"}, {"size": "1"}]}}}}}, {"name": "unknown_16", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/transpose_26/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "PartitionedCall/conv2d_transpose_1/input_sizes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/split_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/transpose_7/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/split_2", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}}}, {"name": "unknown_4", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "PartitionedCall/transpose_8/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Const_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/transpose_10/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/split_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_6", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "PartitionedCall/split_6", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "1"}]}}}}}, {"name": "unknown_12", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/transpose_20/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/transpose_22/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "unknown_14", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/transpose_23/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "PartitionedCall/conv2d_transpose/input_sizes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/split_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "PartitionedCall/split", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/transpose_2/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "PartitionedCall/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/transpose_4/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "PartitionedCall/split_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/transpose_5/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "PartitionedCall/transpose_13/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/split_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_8", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/transpose_14/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/transpose_16/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "unknown_10", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/transpose_17/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "352"}, {"size": "352"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Pad", "op": "Pad", "input": ["input", "PartitionedCall/Const"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/transpose_1", "op": "Transpose", "input": ["PartitionedCall/Pad", "PartitionedCall/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Add", "op": "_FusedConv2D", "input": ["PartitionedCall/transpose_1", "PartitionedCall/split", "unknown_0"], "device": "/device:CPU:0", "attr": {"filter_format": {"s": "SFdJTw=="}, "leakyrelu_alpha": {"f": 0.2}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "num_host_args": {"i": "0"}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}}}, {"name": "PartitionedCall/transpose_2", "op": "Transpose", "input": ["PartitionedCall/Add", "PartitionedCall/transpose_2/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/block_1/relu/Relu", "op": "Relu", "input": ["PartitionedCall/transpose_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Pad_1", "op": "Pad", "input": ["PartitionedCall/onnx_tf_prefix_/block_1/relu/Relu", "PartitionedCall/Const_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/transpose_4", "op": "Transpose", "input": ["PartitionedCall/Pad_1", "PartitionedCall/transpose_4/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Add_1", "op": "_FusedConv2D", "input": ["PartitionedCall/transpose_4", "PartitionedCall/split_1", "unknown_2"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_host_args": {"i": "0"}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "filter_format": {"s": "SFdJTw=="}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/transpose_5", "op": "Transpose", "input": ["PartitionedCall/Add_1", "PartitionedCall/transpose_5/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/block_1/relu_1/Relu", "op": "Relu", "input": ["PartitionedCall/transpose_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Pad_2", "op": "Pad", "input": ["PartitionedCall/onnx_tf_prefix_/block_1/relu_1/Relu", "PartitionedCall/Const_2"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/transpose_13", "op": "Transpose", "input": ["PartitionedCall/onnx_tf_prefix_/block_1/relu_1/Relu", "PartitionedCall/transpose_13/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/transpose_7", "op": "Transpose", "input": ["PartitionedCall/Pad_2", "PartitionedCall/transpose_7/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Add_4", "op": "_FusedConv2D", "input": ["PartitionedCall/transpose_13", "PartitionedCall/split_4", "unknown_8"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "num_host_args": {"i": "0"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "filter_format": {"s": "SFdJTw=="}, "padding": {"s": "VkFMSUQ="}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "PartitionedCall/Add_2", "op": "_FusedConv2D", "input": ["PartitionedCall/transpose_7", "PartitionedCall/split_2", "unknown_4"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "padding": {"s": "VkFMSUQ="}, "leakyrelu_alpha": {"f": 0.2}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "num_host_args": {"i": "0"}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "PartitionedCall/transpose_14", "op": "Transpose", "input": ["PartitionedCall/Add_4", "PartitionedCall/transpose_14/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/transpose_8", "op": "Transpose", "input": ["PartitionedCall/Add_2", "PartitionedCall/transpose_8/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/up_block_1/features/features.1/Relu", "op": "Relu", "input": ["PartitionedCall/transpose_14"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/block_2/relu/Relu", "op": "Relu", "input": ["PartitionedCall/transpose_8"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/transpose_16", "op": "Transpose", "input": ["PartitionedCall/onnx_tf_prefix_/up_block_1/features/features.1/Relu", "PartitionedCall/transpose_16/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Pad_3", "op": "Pad", "input": ["PartitionedCall/onnx_tf_prefix_/block_2/relu/Relu", "PartitionedCall/Const_3"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["PartitionedCall/conv2d_transpose/input_sizes", "PartitionedCall/split_5", "PartitionedCall/transpose_16"], "attr": {"data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/transpose_10", "op": "Transpose", "input": ["PartitionedCall/Pad_3", "PartitionedCall/transpose_10/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Add_5", "op": "AddV2", "input": ["PartitionedCall/conv2d_transpose", "unknown_10"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Add_3", "op": "_FusedConv2D", "input": ["PartitionedCall/transpose_10", "PartitionedCall/split_3", "unknown_6"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "use_cudnn_on_gpu": {"b": true}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "explicit_paddings": {"list": {}}, "num_host_args": {"i": "0"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "PartitionedCall/transpose_17", "op": "Transpose", "input": ["PartitionedCall/Add_5", "PartitionedCall/transpose_17/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Add_6", "op": "_FusedConv2D", "input": ["PartitionedCall/Add_3", "PartitionedCall/split_6", "unknown_12"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "filter_format": {"s": "SFdJTw=="}, "num_args": {"i": "1"}, "num_host_args": {"i": "0"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity_2", "op": "Identity", "input": ["PartitionedCall/transpose_17"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/transpose_20", "op": "Transpose", "input": ["PartitionedCall/Add_6", "PartitionedCall/transpose_20/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/up_block_2/features/features.1/Relu", "op": "Relu", "input": ["PartitionedCall/transpose_20"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/transpose_22", "op": "Transpose", "input": ["PartitionedCall/onnx_tf_prefix_/up_block_2/features/features.1/Relu", "PartitionedCall/transpose_22/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/conv2d_transpose_1", "op": "Conv2DBackpropInput", "input": ["PartitionedCall/conv2d_transpose_1/input_sizes", "PartitionedCall/split_7", "PartitionedCall/transpose_22"], "attr": {"padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}}}, {"name": "PartitionedCall/Add_7", "op": "AddV2", "input": ["PartitionedCall/conv2d_transpose_1", "unknown_14"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/transpose_23", "op": "Transpose", "input": ["PartitionedCall/Add_7", "PartitionedCall/transpose_23/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "Identity_1", "op": "Identity", "input": ["PartitionedCall/transpose_23"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/Concat", "op": "ConcatV2", "input": ["PartitionedCall/transpose_17", "PartitionedCall/transpose_23", "PartitionedCall/onnx_tf_prefix_/Concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/transpose_25", "op": "Transpose", "input": ["PartitionedCall/onnx_tf_prefix_/Concat", "PartitionedCall/transpose_25/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Add_8", "op": "_FusedConv2D", "input": ["PartitionedCall/transpose_25", "PartitionedCall/split_8", "unknown_16"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}, "filter_format": {"s": "SFdJTw=="}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.2}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_host_args": {"i": "0"}, "num_args": {"i": "1"}}}, {"name": "PartitionedCall/transpose_26", "op": "Transpose", "input": ["PartitionedCall/Add_8", "PartitionedCall/transpose_26/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["PartitionedCall/transpose_26"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1766}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "PartitionedCall/onnx_tf_prefix_/Concat/axis", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/transpose_25/perm", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/split_8", "shape": [1, 1, 2, 1], "dtype": "float32"}, {"name": "unknown_16", "shape": [1], "dtype": "float32"}, {"name": "PartitionedCall/transpose_26/perm", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/conv2d_transpose_1/input_sizes", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/split_7", "shape": [2, 2, 1, 1], "dtype": "float32"}, {"name": "PartitionedCall/Const_2", "shape": [4, 2], "dtype": "int32"}, {"name": "PartitionedCall/transpose_7/perm", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/split_2", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "unknown_4", "shape": [128], "dtype": "float32"}, {"name": "PartitionedCall/transpose_8/perm", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/Const_3", "shape": [4, 2], "dtype": "int32"}, {"name": "PartitionedCall/transpose_10/perm", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/split_3", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "unknown_6", "shape": [128], "dtype": "float32"}, {"name": "PartitionedCall/split_6", "shape": [1, 1, 128, 1], "dtype": "float32"}, {"name": "unknown_12", "shape": [1], "dtype": "float32"}, {"name": "PartitionedCall/transpose_20/perm", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/transpose_22/perm", "shape": [4], "dtype": "int32"}, {"name": "unknown_14", "shape": [1], "dtype": "float32"}, {"name": "PartitionedCall/transpose_23/perm", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/conv2d_transpose/input_sizes", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/split_5", "shape": [2, 2, 1, 1], "dtype": "float32"}, {"name": "PartitionedCall/Const", "shape": [4, 2], "dtype": "int32"}, {"name": "PartitionedCall/transpose_1/perm", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/split", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "unknown_0", "shape": [32], "dtype": "float32"}, {"name": "PartitionedCall/transpose_2/perm", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/Const_1", "shape": [4, 2], "dtype": "int32"}, {"name": "PartitionedCall/transpose_4/perm", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/split_1", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "unknown_2", "shape": [64], "dtype": "float32"}, {"name": "PartitionedCall/transpose_5/perm", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/transpose_13/perm", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/split_4", "shape": [1, 1, 64, 1], "dtype": "float32"}, {"name": "unknown_8", "shape": [1], "dtype": "float32"}, {"name": "PartitionedCall/transpose_14/perm", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/transpose_16/perm", "shape": [4], "dtype": "int32"}, {"name": "unknown_10", "shape": [1], "dtype": "float32"}, {"name": "PartitionedCall/transpose_17/perm", "shape": [4], "dtype": "int32"}]}]}